var score_total = parseInt(localStorage.getItem("score_total"));
var score_spend = parseInt(localStorage.getItem("score_spend"));
var perstatus = localStorage.getItem(localStorage.getItem("now")).split(",");

var a = {"人物":[["아버지", "어머니", "오빠", "형", "누나", "언니", "동생", "남동생", "여동생", "선생님 ", "의사", "운전사", "학생", "노인", "부부", "사람들", "선배", "성인", "손님", "아들", "딸", "외할머니", "외할아버지", "요리사","덕후","광팬","성덕","악개","사생","덕후","안티팬","최애","머글"],["爸爸", "媽媽", "哥哥(女稱呼男)", "哥哥(男稱呼男)", "姐姐(男稱呼女)", "姐姐(女稱呼女)", "弟弟或妹妹", "弟弟", "妹妹", "老師", "醫生", "司機", "學生", "老人", "夫婦", "人們", "前輩", "成年人", "客人", "兒子", "女兒", "外婆", "外公", "廚師","追星族","狂粉","成功的粉絲","毒唯飯","私生飯","迷弟、迷妹","黑粉","本命","麻瓜"],["名","名","名","名","名","名","名","名","名","名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名"]],
"地點":[["가게", "기차역", "길", "집", "은행", "빵집", "병원", "교실", "우체국 ", "도서관", "화장실 ", "영화관", "대학교", "백화점", "지하철", "식당", "슈퍼마켓", "회사", "공원", "학교", "방", "엘리베이터", "계단", "도시 ", "공항", "기숙사", "대사관", "문구점", "박물관", "산", "서점", "시청", "아파트","콘서트","공카","팬싸인회","팬클럽"], ["店鋪", "火車站", "路", "家", "銀行", "麵包店", "醫院", "教室", "郵局", "圖書館", "廁所", "電影院", "大學", "百貨公司", "地鐵", "餐廳", "超市", "公司", "公園", "學校", "房間", "電梯", "樓梯", "城市", "機場", "宿舍", "大使館", "文具店", "博物館", "山", "書店", "市政府", "公寓","演唱會","官方Cafe","簽名會","粉絲團"],["名","名","名","名","名","名","名","名","名","名","名","名","名","名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名"]],
"節日":[ ["생일", "설날", "아침", "어제", "오늘", "내일", "오전", "오후", "올해", "일주일", "봄", "여름", "가을", "겨울"],["生日", "新年、元旦", "早晨", "昨天", "今天", "明天", "上午", "下午", "今年", "一週", "春天", "夏天", "秋天", "冬天"],["名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名"]],
"方位":[["오른쪽 ", "왼쪽", "위쪽", "아래쪽", "앞쪽", "뒤쪽", "中間", "안", "밖", "맞은편", "모퉁이", "옆", "부근", "북쪽", "남방", "동방", "서쪽"], ["右邊", "左邊", "上面", "下面", "前面", "後面", "中間", "裡面", "外面", "對面", "角落", "旁邊", "附近", "北方", "南方", "東方", "西方"],["名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名"]],
"時間":[["생일","설날","아침","어제","오늘","내일","오전","오후","올해 ","일주일","봄","여름","가을","겨울"],["生日","新年、元旦","早晨","昨天","今天","明天","上午","下午","今年","一週","春天","夏天","秋天","冬天"],["名","名","名","名","名","名","名","名","名","名","名","名","名","名"]],
"狀態":[["가깝다", "멀다", "가볍다", "같다", "게으르다", "고프다", "급하다", "길다", "짧다", "깊다", "얕다", "깨끗하다", "더럽다", "넓다", "좁다", "많다", "적다", "맛있다", "멋있다", "슬프다", "싸다", "비싸다", "아름답다 ", "어렵다", "쉽다"],["近、不遠的", "遠的", "輕的", "一樣", "懶惰", "餓", "急", "長", "短", "深", "淺", "乾淨的", "髒的", "寬", "窄", "多", "少", "好吃", "帥氣", "悲傷的", "便宜的", "貴的", "美麗的", "困難", "容易"],["形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形", "形"]],
"動作":[["배우다", "가다", "가르치다", "고맙습니다", "그치다", "끝나다", "뛰다", "만들다", "먹다", "모이다", "배우다", "부르다", "부치다", "사다", "팔다", "쉬다", "쓰다", "열다", "웃다", "읽다", "자다", "찾다", "켜다","덕질","입덕","탈덕","티켓팅"],["學習", "去", "教", "謝謝", "停止", "結束", "跑", "製造", "吃", "聚集、收集", "學習", "唱、喊", "郵寄", "購買", "賣", "休息", "寫", "打開", "笑", "閱讀", "睡覺", "尋找", "開、啟動","追星","入坑","脱粉","搶票"],["動","動","動","動","動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動", "動"]],
"副詞連接詞":[["계속", "그냥", "그럼", "금방", "때때로 ", "마침내", "매우", "먼저", "모두", "미리", "벌써", "아마", "약간", "언제나", "왜 ", "자주", "잠깐만", "좀", "주로 ", "함께", "훨씬", "그래서", "그런데", "그리고", "하지만", "또한"],["繼續、一直", "仍舊", "那麼", "剛剛", "有時", "終於", "非常、十分", "先(表示順序)", "全部", "事先、預先", "早就、已經", "可能", "稍微", "總是、習慣性地", "為什麼", "經常", "片刻", "稍微", "主要", "一起", "(程度)更", "因此、所以", "但是", "還、然後", "可是", "並且"],["副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "副", "連", "連", "連", "連", "連"]],
"物品":[["김치", "김밥", "꽃", "나라", "농구", "눈물", "달", "해", "드라마", "라디오 ", "먼지", "메뉴", "목욕", "무료", "방법", "방학", "봉투", "비행기", "사진", "색깔", "생각", "생활", "선물 ", "선풍기 ", "소포", "스트레스", "식물", "신문", "신발", "아이스크림", "안경", "약", "약속", "에어컨", "영화", "음료수", "음식 ", "음악", "입장료", "자동차", "자전거","앨범","포카","야광봉","응원봉","티켓","굿즈"],["泡菜", "紫菜飯", "花", "國家", "籃球", "眼淚", "月亮", "太陽", "電視劇", "收音機", "塵土、灰塵", "菜單、選單", "洗澡", "免費", "方法", "假期、放假", "信封", "飛機", "照片", "色彩", "想法", "生活", "禮物", "電風扇", "包裹", "壓力", "植物", "報紙", "鞋", "冰淇淋", "眼鏡", "藥", "約定、約會", "空調", "電影", "飲料", "食物", "音樂", "入場費、門票", "汽車", "腳踏車","專輯","小卡","螢光棒","應援棒","演唱會門票","周邊"],["名","名","名","名","名","名","名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名", "名"]]
}

console.log(a[localStorage.getItem("now")])

var perkor = a[localStorage.getItem("now")][0]
var perchin = a[localStorage.getItem("now")][1]
var perword = a[localStorage.getItem("now")][2]
var canplay;

console.log(perstatus)


function check() {
    canplay = []
    for (let i = 0; i < perkor.length; i++) {
        // console.log(perstatus[i])
        if (perstatus[i] == 1) {
            canplay.push(i);
        }
    }
}

function start() {
    $("img").hide();
    const button = document.getElementById("play");
    button.addEventListener("click",play,false);  
    check();
    console.log(canplay);
    display();
}

function display() {
    var text1 = "<tr><th>韓文</th><th>中文</th><th>詞性</th></tr>";
    var text2 = "<tr><th>韓文</th><th>中文</th><th>詞性</th></tr>";
    check();
    // console.log(canplay)
    document.getElementById("rest").innerHTML = "未背單字(" + canplay.length + ")";
    document.getElementById("alre").innerHTML = "已背單字(" + (perkor.length-canplay.length) + ")";
    for (let i = 0; i < perkor.length; i++) {
        if (perstatus[i] == 1) {
            text1 += "<tr><td>"+perkor[i]+"</td><td>"+perchin[i]+"</td><td>"+perword[i]+"詞</td></tr>";
        }
        else{
            text2 += "<tr><td>"+perkor[i]+"</td><td>"+perchin[i]+"</td><td>"+perword[i]+"詞</td></tr>";
        }
    }
    var ta1 = document.getElementById("ta1");
    ta1.innerHTML = text1;
    var ta2 = document.getElementById("ta2");
    ta2.innerHTML = text2;  
}

function play() {
    var newNode = document.createElement("img");
    //https://static.rti.org.tw/assets/thumbnails/2019/03/18/4051762897a648062eeefe267ad8f780.jpg
    newNode.setAttribute("src","cover.jpeg");
    var parentDiv = document.getElementById("abc").parentNode;
    var sp2 = document.getElementById("abc");
    parentDiv.insertBefore(newNode, sp2);
    setTimeout(()=>{
        localStorage.setItem(localStorage.getItem("now"),perstatus)
        if (canplay.length == 0) {
            window.confirm("太好了～\n你已經背完啦！")
            $("img").hide();
        }
        else{
            var ram = Math.floor(Math.random() * canplay.length);
            var person = prompt(perkor[canplay[ram]]);
            if (person == perchin[canplay[ram]]) {
                perstatus[canplay[ram]] = 0;
                score_total += 1;
                score_spend += 1;
                localStorage.setItem("score_spend",score_spend);
                localStorage.setItem("score_total",score_total);
                display();
                check();
                play();
            }
            else{
                window.confirm("提示：" + perword[canplay[ram]] + "詞");
                person = prompt(perkor[canplay[ram]]);
                if (person == perchin[canplay[ram]]){
                    perstatus[canplay[ram]] = 0;
                    score_total += 1;
                    score_spend += 1;
                    display();
                    check();
                    play();
                }
                else {
                    window.alert("再多背背吧！");
                    $("img").hide();
                }
            }
        }
    },100)
    
    
}

window.addEventListener("load",start,false);
